{
  "id": 26020,
  "url": "https://www.tvmaze.com/shows/26020/young-sheldon",
  "name": "Young Sheldon",
  "type": "Scripted",
  "language": "English",
  "genres": [
    "Comedy",
    "Family"
  ],
  "status": "Running",
  "runtime": 30,
  "averageRuntime": 30,
  "premiered": "2017-09-25",
  "ended": null,
  "officialSite": "http://www.cbs.com/shows/young-sheldon/",
  "schedule": {
    "time": "20:00",
    "days": [
      "Thursday"
    ]
  },
  "rating": {
    "average": 7.3
  },
  "weight": 100,
  "network": {
    "id": 2,
    "name": "CBS",
    "country": {
      "name": "United States",
      "code": "US",
      "timezone": "America/New_York"
    },
    "officialSite": "https://www.cbs.com/"
  },
  "webChannel": null,
  "dvdCountry": null,
  "externals": {
    "tvrage": null,
    "thetvdb": 328724,
    "imdb": "tt6226232"
  },
  "image": {
    "medium": "https://static.tvmaze.com/uploads/images/medium_portrait/501/1253825.jpg",
    "original": "https://static.tvmaze.com/uploads/images/original_untouched/501/1253825.jpg"
  },
  "summary": "<p>For young Sheldon Cooper, it isn't easy growing up in East Texas. Being a once-in-a-generation mind capable of advanced mathematics and science isn't always helpful in a land where church and football are king. And while the vulnerable, gifted and somewhat naïve Sheldon deals with the world, his very normal family must find a way to deal with him. His father, George, is struggling to find his way as a high school football coach and as father to a boy he doesn't understand. Sheldon's mother, Mary, fiercely protects and nurtures her son in a town where he just doesn't fit in. Sheldon's older brother, Georgie, does the best he can in high school, but it's tough to be cool when you're in the same classes with your odd younger brother. Sheldon's twin sister, Missy, sometimes resents all the attention Sheldon gets, but also remains the one person who can reliably tell Sheldon the truth. Finally, there's Sheldon's beloved Meemaw, his foul-mouthed, hard-drinking Texas grandmother who is very supportive of her grandson and his unique gifts. For 12 years on <i>The Big Bang Theory</i>, audiences have come to know the iconic, eccentric, and extraordinary Sheldon Cooper. This single-camera, half-hour comedy allows us the chance to meet him in childhood, as he embarks on his innocent, awkward, and hopeful journey toward the man he will become.</p>",
  "updated": 1707665040,
  "_links": {
    "self": {
      "href": "https://api.tvmaze.com/shows/26020"
    },
    "previousepisode": {
      "href": "https://api.tvmaze.com/episodes/2496131"
    },
    "nextepisode": {
      "href": "https://api.tvmaze.com/episodes/2687413"
    }
  }
}